Revit 2027 API
TranslationRotationValue Enumeration
 Specifies the type of condition applied to the translation or rotation parameter.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TranslationRotationValue
Public Enumeration TranslationRotationValue
public enum class TranslationRotationValue
type TranslationRotationValue
Members
Member name | Value | Description
Fixed | 0 |  The type of condition is Fixed.
Release | 1 |  The type of condition is Release.
Spring | 2 |  The type of condition is Spring.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace